_posts/2018-04-14-Rubik-in-matrix.markdown
---
layout: post
title: Rubik in matrix
excerpt: represent rubik cube with complex matrix and some conclusion
categories:
    - paper
tags:
    - paper
layout: post
---
<p>
Rubik cube (3 x 3) is interesting toy with many status. In this paper we build one-to-one map from those status to a complex matrix, and define all operations by this kind of matrix. With help of these defination, we find some invarience which lead to prove of some related conclusion. Also, we convert the "God number" problem to matrix deconpose problem, hope this will help solve it. Finaly, with the prove, if we have manage to get it done, we will have best solve algorithm as side-effect.
</p>

<ol class="org-ol">
<li>matrix represent rubik status.
</li>
</ol>
<p>
1.1 rubik oritation notion.
1.2 matrix map to status.
1.3 operation matrix defination and caculation.
</p>
<ol class="org-ol">
<li>invarience and explain.
</li>
</ol>
